------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  logDofile
       log:  G:/My Drive/projects/projectMultimorbidity/outfiles/logs/logdoSHARE-2-harmonPart5.txt
  log type:  text
 opened on:  23 Dec 2023, 17:01:00

. 
.         
.         
. ****************************************************************************************************
. *Part 5*: Generate study-specific variables while in 'long' format 
. **note: recode/relabel/rename variables from dataset and generate new variables**
. ****************************************************************************************************
. 
.         
. ***rename key variables***
. rename  panelid ID

. rename  ageyr age 

. rename  inw7c inw7

. order   inw7, before(inw8) // need to reorder for inw_tot

. rename  lbrf_sr lbrfr /*lbrf question slightly differ in S compared to HRS*/

. 
. 
. ***generate alternative for "wave", as survey year***
. **generate time**
. recode  wave (1 = 2004 "2004 wave") (2 = 2006 "2006/07 wave") (3 = 2008 "2008/09 wave") (4 = 2011 "2011/12 wave") (5 = 2013 "2013 wave") (6 = 2015 "2015 wave") (7 = 2017 "2017 wave") (8 = 2019 "2019/20 wave") , gen(time)
(1,116,960 differences between wave and time)

. la var  time "Survey Year (Wave)"

. **relabel wave to survey-specific value-labels**
. la de   wavel 1 "2004 wave" 2 "2006/07 wave" 3 "2008/09 wave" 4 "2011/12 wave" 5 "2013 wave" 6 "2015 wave" 7 "2017 wave" 8 "2019/20 wave" , replace

. la val  wave wavel

. 
. ***vars related to survey participation***
. **participation frequency/timing**
. *!caution!: all vars/columns inw should be next to each other in dataset 
. egen    inw_tot  = rowtotal(inw1-inw`wavelast')                         // counts # of periods ID present

. egen    inw_miss = anycount(inw1-inw`wavelast'), values(0)      // counts # of periods ID *not* present

. tab     inw_tot inw_miss 

           |                   inw1 inw2 inw4 inw5 inw6 inw7 inw8 == 0
   inw_tot |         0          1          2          3          4          5          6 |     Total
-----------+-----------------------------------------------------------------------------+----------
         1 |         0          0          0          0          0          0    328,744 |   328,744 
         2 |         0          0          0          0          0    267,360          0 |   267,360 
         3 |         0          0          0          0    170,072          0          0 |   170,072 
         4 |         0          0          0    160,280          0          0          0 |   160,280 
         5 |         0          0    117,608          0          0          0          0 |   117,608 
         6 |         0     43,936          0          0          0          0          0 |    43,936 
         7 |    28,960          0          0          0          0          0          0 |    28,960 
-----------+-----------------------------------------------------------------------------+----------
     Total |    28,960     43,936    117,608    160,280    170,072    267,360    328,744 | 1,116,960 

. 
. **in current wave**
. gen     inwt = (age<.) // treat sb w/ miss. age as not in wave; missing age often matches with inw

. la var  inwt "in curr. wave"

. *tab    inwt inw1 if wave==1
. 
. **inw_first (entry into survey)**
. gen              myvar          = wave if inwt==1 
(733,337 missing values generated)

. bys ID: egen inw_first  = min(myvar) 
(192 missing values generated)

. drop             myvar

. 
. li ID            wave inw* in 1/3

     +----------------------------------------------------------------------------------------------------------------------------------------------------+
     | ID           wave           inw1           inw2        inw4        inw5        inw6        inw7        inw8   inw_tot   inw_miss   inwt   inw_fi~t |
     |----------------------------------------------------------------------------------------------------------------------------------------------------|
  1. |  1      2004 wave   1.resp,alive   1.resp,alive   0.nonresp   0.nonresp   0.nonresp   0.nonresp   0.nonresp         2          5      1          1 |
  2. |  1   2006/07 wave   1.resp,alive   1.resp,alive   0.nonresp   0.nonresp   0.nonresp   0.nonresp   0.nonresp         2          5      1          1 |
  3. |  1   2008/09 wave   1.resp,alive   1.resp,alive   0.nonresp   0.nonresp   0.nonresp   0.nonresp   0.nonresp         2          5      0          1 |
     +----------------------------------------------------------------------------------------------------------------------------------------------------+

. *sum             inw_first // not all participants are ever present in survey
. la var           inw_first "wave first observed"

. tab              inw_first wave,m 

wave first |                                       Survey Wave
  observed | 2004 wave  2006/07 w  2008/09 w  2011/12 w  2013 wave  2015 wave  2017 wave  2019/20 w |     Total
-----------+----------------------------------------------------------------------------------------+----------
         1 |    30,416     30,416     30,416     30,416     30,416     30,416     30,416     30,416 |   243,328 
         2 |    16,238     16,238     16,238     16,238     16,238     16,238     16,238     16,238 |   129,904 
         4 |    37,809     37,809     37,809     37,809     37,809     37,809     37,809     37,809 |   302,472 
         5 |    23,078     23,078     23,078     23,078     23,078     23,078     23,078     23,078 |   184,624 
         6 |    12,269     12,269     12,269     12,269     12,269     12,269     12,269     12,269 |    98,152 
         7 |    19,020     19,020     19,020     19,020     19,020     19,020     19,020     19,020 |   152,160 
         8 |       766        766        766        766        766        766        766        766 |     6,128 
         . |        24         24         24         24         24         24         24         24 |       192 
-----------+----------------------------------------------------------------------------------------+----------
     Total |   139,620    139,620    139,620    139,620    139,620    139,620    139,620    139,620 | 1,116,960 

. 
. **time since first observed (entry into survey)**
. *note: MUST generate BEFORE gap appears (e.g. before deleting wave 3 (Life-history) from the panel)*
.         /*time_sincefirstobs: in waves*
>         bys ID: gen time_sincefirstobs = _n -1                                   if wave>=inw_first     
>         replace time_sincefirstobs      = time_sincefirstobs - inw_first + 1 /*subtract time first observed*/   
>         */
.         /*time_sincefirstobs: in years*
>         su              time, meanonly
>         local   timemin= r(min)
>         gen     time_sincebaseline = time - `timemin' // use first survey wave  
>                 gen              myvar                  = time_sincebaseline if inwt==1 
>                 bys ID: egen inw_firstyr        = min(myvar) 
>                 drop             myvar
>                 tab inw_first inw_firstyr,m     
>         gen time_sincefirstobs = time_sincebaseline - inw_firstyr  if wave>=inw_first
>         */
. **time_sincefirstobs: in years (using interview year as time)** 
. su              iwyr, meanonly

. loc     timemin= r(min) // take first survey year as starting time for 'time' 

. di              `timemin' 
2004

. gen     time_sincefirstwave = iwyr - `timemin' // interview time w.r.t. first survey time
(733,313 missing values generated)

. gen                     myvar                   = time_sincefirstwave if inwt==1 
(733,337 missing values generated)

. bys ID: egen    inw_first_yr    = min(myvar)    // inw_first in years, not waves
(192 missing values generated)

. gen time_sincefirstobs = time_sincefirstwave - inw_first_yr if wave>=inw_first // time from first obs to iwyr
(733,337 missing values generated)

. li              ID wave time inwt inw_first* time_sincefirstwave time_sincefirstobs  in 300/310

     +-------------------------------------------------------------------------------------+
     | ID           wave           time   inwt   inw_fi~t   inw_fi~r   time_s~e   time_s~s |
     |-------------------------------------------------------------------------------------|
300. | 38   2011/12 wave   2011/12 wave      1          4          7          7          0 |
301. | 38      2013 wave      2013 wave      1          4          7          9          2 |
302. | 38      2015 wave      2015 wave      1          4          7         11          4 |
303. | 38      2017 wave      2017 wave      1          4          7         13          6 |
304. | 38   2019/20 wave   2019/20 wave      1          4          7         15          8 |
     |-------------------------------------------------------------------------------------|
305. | 39      2004 wave      2004 wave      0          4          7          .          . |
306. | 39   2006/07 wave   2006/07 wave      0          4          7          .          . |
307. | 39   2008/09 wave   2008/09 wave      0          4          7          .          . |
308. | 39   2011/12 wave   2011/12 wave      1          4          7          7          0 |
309. | 39      2013 wave      2013 wave      1          4          7          9          2 |
     |-------------------------------------------------------------------------------------|
310. | 39      2015 wave      2015 wave      1          4          7         11          4 |
     +-------------------------------------------------------------------------------------+

. drop    myvar time_sincefirstwave 

. *tab    inw_first inw_first_yr,m // sometimes, first iwyr is different from first wave
. sum     time_sincefirstobs

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
time_since~s |    383,623    3.696056    3.982809          0         16

. la var  time_sincefirstobs      "time since first observed"

. tab     iwyr time_sincefirstobs

         r |
 interview |                                                                                 time since first observed
      year |         0          1          2          3          4          5          6          7          8          9         10         11         12         13         14         15         16 |     Total
-----------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
      2004 |    22,204          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |    22,204 
      2005 |     6,501          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     6,501 
      2006 |     4,233      1,388      4,011          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     9,632 
      2007 |    12,955          0      2,855     10,963          0          0          0          0          0          0          0          0          0          0          0          0          0 |    26,773 
      2009 |       173          0          0        454        249          0          0          0          0          0          0          0          0          0          0          0          0 |       876 
      2010 |     2,216          0          0          0        675        309          0          0          0          0          0          0          0          0          0          0          0 |     3,200 
      2011 |    35,960          0          0          0      4,989      1,192      2,760      9,661          0          0          0          0          0          0          0          0          0 |    54,562 
      2012 |       221          0          0          0          0      1,346        185          0         52          0          0          0          0          0          0          0          0 |     1,804 
      2013 |    23,078          2     22,767      1,743        119          0      4,600      1,933      2,886      8,934          0          0          0          0          0          0          0 |    66,062 
      2015 |    12,269          0     15,274        157     20,411      1,503        103          0      5,455      1,802      2,895      8,212          0          0          0          0          0 |    68,081 
      2017 |    19,013          0      7,888          0     12,991        130     18,733      1,356         92          0      4,760      1,672      2,627      7,142          0          0          0 |    76,404 
      2018 |         4          0          0         46          0          0          0        697          0          0          0          0          0          0          0          0          0 |       747 
      2019 |       290          0      3,918          0      1,686          0      4,290         27      5,483        325         28          0      1,568        618        589      2,978          0 |    21,800 
      2020 |       479          0          0      5,395          0      3,543          0      4,204         47      5,723        416         27          0      1,673        390        777      2,303 |    24,977 
-----------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |   139,596      1,390     56,713     18,758     41,120      8,023     30,671     17,878     14,015     16,784      8,099      9,911      4,195      9,433        979      3,755      2,303 |   383,623 

. tab     time time_sincefirstobs 

 Survey Year |                                                                                 time since first observed
      (Wave) |         0          1          2          3          4          5          6          7          8          9         10         11         12         13         14         15         16 |     Total
-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
   2004 wave |    30,416          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |    30,416 
2006/07 wave |    16,238      1,388      6,866     11,417        924        309          0          0          0          0          0          0          0          0          0          0          0 |    37,142 
2011/12 wave |    37,809          0          0          0      4,989      2,538      2,945      9,661         52          0          0          0          0          0          0          0          0 |    57,994 
   2013 wave |    23,078          2     22,767      1,743        119          0      4,600      1,933      2,886      8,934          0          0          0          0          0          0          0 |    66,062 
   2015 wave |    12,269          0     15,274        157     20,411      1,503        103          0      5,455      1,802      2,895      8,212          0          0          0          0          0 |    68,081 
   2017 wave |    19,020          0      7,888         46     13,000        130     18,733      2,053        124          0      4,760      1,672      2,627      7,142          0          0          0 |    77,195 
2019/20 wave |       766          0      3,918      5,395      1,677      3,543      4,290      4,231      5,498      6,048        444         27      1,568      2,291        979      3,755      2,303 |    46,733 
-------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
       Total |   139,596      1,390     56,713     18,758     41,120      8,023     30,671     17,878     14,015     16,784      8,099      9,911      4,195      9,433        979      3,755      2,303 |   383,623 

. tab     inw_first time_sincefirstobs

wave first |                                                                                 time since first observed
  observed |         0          1          2          3          4          5          6          7          8          9         10         11         12         13         14         15         16 |     Total
-----------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         1 |    30,416      1,388      6,866     11,417        924        309      2,760     10,645      2,938      9,737      2,895      8,997      2,627      7,351        767      3,755      2,303 |   106,095 
         2 |    16,238          0          0        451      5,108      2,902      4,888      1,277      5,547      1,045      4,857        914      1,568      2,082        212          0          0 |    47,089 
         4 |    37,809          2     22,767      1,449     20,411      1,269     18,733      1,752      5,530      6,002        347          0          0          0          0          0          0 |   116,071 
         5 |    23,078          0     15,274          0     12,991          0      4,290      4,204          0          0          0          0          0          0          0          0          0 |    59,837 
         6 |    12,269          0      7,888         46      1,686      3,543          0          0          0          0          0          0          0          0          0          0          0 |    25,432 
         7 |    19,020          0      3,918      5,395          0          0          0          0          0          0          0          0          0          0          0          0          0 |    28,333 
         8 |       766          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |       766 
-----------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |   139,596      1,390     56,713     18,758     41,120      8,023     30,671     17,878     14,015     16,784      8,099      9,911      4,195      9,433        979      3,755      2,303 |   383,623 

. 
. 
. 
. // A: demographics, identifiers, weights
. recode  ragender                (1 = 1 "1.male") (2 = 0 "0.female"), gen(male)
(621,656 differences between ragender and male)

. la var  male                    "male"

. tab     ragender male   // check if generation above was correct        

 ragender: |         male
  r gender |  0.female     1.male |     Total
-----------+----------------------+----------
     1.man |         0    495,304 |   495,304 
   2.woman |   621,656          0 |   621,656 
-----------+----------------------+----------
     Total |   621,656    495,304 | 1,116,960 

. 
. recode  mstatr                  (1/3 = 1 "1.married/partnered") (4/8 = 0 "0.not married"), gen(marriedr)
(122,526 differences between mstatr and marriedr)

. recode  mstatr                  (7 = 1 "1.widowed") (1/5 = 0 "0.not widowed") (8 = .), gen(widowedr) 
(383,124 differences between mstatr and widowedr)

. gen     nevmarriedr =   (mstatr==8) if mstatr<.
(733,836 missing values generated)

. bys ID: egen nevmarried_c = max(nevmarriedr)
(1,448 missing values generated)

. la var  married                 "married or partnered"  

. la var  nevmarried_c    "never married (ever)"

. tab     mstatr marriedr, m

      r marital |
         status |
    w/partners, |                       married or partnered
         filled | 0.not mar  1.married          .         .d         .m         .r |     Total
----------------+------------------------------------------------------------------+----------
      1.married |         0    260,598          0          0          0          0 |   260,598 
    3.partnered |         0     22,758          0          0          0          0 |    22,758 
    4.separated |     3,196          0          0          0          0          0 |     3,196 
     5.divorced |    24,041          0          0          0          0          0 |    24,041 
      7.widowed |    56,167          0          0          0          0          0 |    56,167 
8.never married |    16,364          0          0          0          0          0 |    16,364 
              . |         0          0    733,313          0          0          0 |   733,313 
          .d:DK |         0          0          0         37          0          0 |        37 
     .m:Missing |         0          0          0          0        422          0 |       422 
      .r:Refuse |         0          0          0          0          0         64 |        64 
----------------+------------------------------------------------------------------+----------
          Total |    99,768    283,356    733,313         37        422         64 | 1,116,960 

. tab     mstatr widowed,m /*(!) note: never married is set to missing for widowed*/

      r marital |
         status |
    w/partners, |      RECODE of mstatr (r marital status w/partners, filled)
         filled | 0.not wid  1.widowed          .         .d         .m         .r |     Total
----------------+------------------------------------------------------------------+----------
      1.married |   260,598          0          0          0          0          0 |   260,598 
    3.partnered |    22,758          0          0          0          0          0 |    22,758 
    4.separated |     3,196          0          0          0          0          0 |     3,196 
     5.divorced |    24,041          0          0          0          0          0 |    24,041 
      7.widowed |         0     56,167          0          0          0          0 |    56,167 
8.never married |         0          0     16,364          0          0          0 |    16,364 
              . |         0          0    733,313          0          0          0 |   733,313 
          .d:DK |         0          0          0         37          0          0 |        37 
     .m:Missing |         0          0          0          0        422          0 |       422 
      .r:Refuse |         0          0          0          0          0         64 |        64 
----------------+------------------------------------------------------------------+----------
          Total |   310,593     56,167    749,677         37        422         64 | 1,116,960 

. tab     mstatr nevmarriedr,m

      r marital |
         status |
    w/partners, |           nevmarriedr
         filled |         0          1          . |     Total
----------------+---------------------------------+----------
      1.married |   260,598          0          0 |   260,598 
    3.partnered |    22,758          0          0 |    22,758 
    4.separated |     3,196          0          0 |     3,196 
     5.divorced |    24,041          0          0 |    24,041 
      7.widowed |    56,167          0          0 |    56,167 
8.never married |         0     16,364          0 |    16,364 
              . |         0          0    733,313 |   733,313 
          .d:DK |         0          0         37 |        37 
     .m:Missing |         0          0        422 |       422 
      .r:Refuse |         0          0         64 |        64 
----------------+---------------------------------+----------
          Total |   366,760     16,364    733,836 | 1,116,960 

. tab     nevmarriedr nevmarried_c /*few people could have married, most likely though inaccurate responses*/

nevmarried | never married (ever)
         r |         0          1 |     Total
-----------+----------------------+----------
         0 |   366,060        700 |   366,760 
         1 |         0     16,364 |    16,364 
-----------+----------------------+----------
     Total |   366,060     17,064 |   383,124 

. 
. **ages, cohorts (choice of definition depends on survey sampling eligibility)**
. // age first/last observed
. bys ID: egen agemin=min(age)                    /*age at first response across years*/ 
(192 missing values generated)

. bys ID: egen agemax=max(age)                    /*age at last  response across years*/ 
(192 missing values generated)

. la var           agemin "age when first observed"

. gen              ageatfirstobs = agemin
(192 missing values generated)

. 
. **define cohorts (choice of definition depends on survey sampling eligibility)**
. egen            cohort          = cut(age)       , at (`agethreshold',60,70,80,120)     
(740,389 missing values generated)

. egen            cohortmin       = cut(agemin), at (`agethreshold',60,70,80,120)
(39,536 missing values generated)

. tab             cohort

     cohort |      Freq.     Percent        Cum.
------------+-----------------------------------
         50 |     97,946       26.01       26.01
         60 |    131,586       34.94       60.95
         70 |     97,101       25.79       86.74
         80 |     49,938       13.26      100.00
------------+-----------------------------------
      Total |    376,571      100.00

. la de           cohortl `agethreshold' "`agethreshold'-59" 60 "60-69" 70 "70-79" 80 "80+"       

. la val          cohort cohortl // labels value labels

. tab                     age             cohort, m

     r age |
(years) at |                         cohort
       ivw |     50-59      60-69      70-79        80+          . |     Total
-----------+-------------------------------------------------------+----------
        14 |         0          0          0          0          1 |         1 
        22 |         0          0          0          0          2 |         2 
        24 |         0          0          0          0          4 |         4 
        25 |         0          0          0          0          5 |         5 
        26 |         0          0          0          0          2 |         2 
        27 |         0          0          0          0          7 |         7 
        28 |         0          0          0          0          3 |         3 
        29 |         0          0          0          0          8 |         8 
        30 |         0          0          0          0         16 |        16 
        31 |         0          0          0          0         24 |        24 
        32 |         0          0          0          0         25 |        25 
        33 |         0          0          0          0         25 |        25 
        34 |         0          0          0          0         37 |        37 
        35 |         0          0          0          0         42 |        42 
        36 |         0          0          0          0         50 |        50 
        37 |         0          0          0          0         66 |        66 
        38 |         0          0          0          0         77 |        77 
        39 |         0          0          0          0         94 |        94 
        40 |         0          0          0          0        143 |       143 
        41 |         0          0          0          0        183 |       183 
        42 |         0          0          0          0        264 |       264 
        43 |         0          0          0          0        306 |       306 
        44 |         0          0          0          0        387 |       387 
        45 |         0          0          0          0        533 |       533 
        46 |         0          0          0          0        707 |       707 
        47 |         0          0          0          0      1,000 |     1,000 
        48 |         0          0          0          0      1,322 |     1,322 
        49 |         0          0          0          0      1,719 |     1,719 
        50 |     4,569          0          0          0          0 |     4,569 
        51 |     7,066          0          0          0          0 |     7,066 
        52 |     8,008          0          0          0          0 |     8,008 
        53 |     9,041          0          0          0          0 |     9,041 
        54 |     9,793          0          0          0          0 |     9,793 
        55 |    10,681          0          0          0          0 |    10,681 
        56 |    11,515          0          0          0          0 |    11,515 
        57 |    12,095          0          0          0          0 |    12,095 
        58 |    12,396          0          0          0          0 |    12,396 
        59 |    12,782          0          0          0          0 |    12,782 
        60 |         0     13,354          0          0          0 |    13,354 
        61 |         0     13,159          0          0          0 |    13,159 
        62 |         0     13,407          0          0          0 |    13,407 
        63 |         0     13,448          0          0          0 |    13,448 
        64 |         0     13,510          0          0          0 |    13,510 
        65 |         0     13,457          0          0          0 |    13,457 
        66 |         0     13,145          0          0          0 |    13,145 
        67 |         0     13,025          0          0          0 |    13,025 
        68 |         0     12,721          0          0          0 |    12,721 
        69 |         0     12,360          0          0          0 |    12,360 
        70 |         0          0     11,638          0          0 |    11,638 
        71 |         0          0     11,621          0          0 |    11,621 
        72 |         0          0     10,860          0          0 |    10,860 
        73 |         0          0     10,505          0          0 |    10,505 
        74 |         0          0      9,797          0          0 |     9,797 
        75 |         0          0      9,501          0          0 |     9,501 
        76 |         0          0      9,008          0          0 |     9,008 
        77 |         0          0      8,519          0          0 |     8,519 
        78 |         0          0      7,950          0          0 |     7,950 
        79 |         0          0      7,702          0          0 |     7,702 
        80 |         0          0          0      7,052          0 |     7,052 
        81 |         0          0          0      6,555          0 |     6,555 
        82 |         0          0          0      5,743          0 |     5,743 
        83 |         0          0          0      5,306          0 |     5,306 
        84 |         0          0          0      4,606          0 |     4,606 
        85 |         0          0          0      4,134          0 |     4,134 
        86 |         0          0          0      3,437          0 |     3,437 
        87 |         0          0          0      2,943          0 |     2,943 
        88 |         0          0          0      2,427          0 |     2,427 
        89 |         0          0          0      1,963          0 |     1,963 
        90 |         0          0          0      1,578          0 |     1,578 
        91 |         0          0          0      1,247          0 |     1,247 
        92 |         0          0          0        868          0 |       868 
        93 |         0          0          0        674          0 |       674 
        94 |         0          0          0        481          0 |       481 
        95 |         0          0          0        310          0 |       310 
        96 |         0          0          0        210          0 |       210 
        97 |         0          0          0        140          0 |       140 
        98 |         0          0          0         84          0 |        84 
        99 |         0          0          0         76          0 |        76 
       100 |         0          0          0         49          0 |        49 
       101 |         0          0          0         17          0 |        17 
       102 |         0          0          0         22          0 |        22 
       103 |         0          0          0         10          0 |        10 
       104 |         0          0          0          4          0 |         4 
       105 |         0          0          0          2          0 |         2 
         . |         0          0          0          0    733,313 |   733,313 
        .d |         0          0          0          0          5 |         5 
        .m |         0          0          0          0         17 |        17 
        .r |         0          0          0          0          2 |         2 
-----------+-------------------------------------------------------+----------
     Total |    97,946    131,586     97,101     49,938    740,389 | 1,116,960 

. tab                     agemin  cohort, m

  age when |
     first |                         cohort
  observed |     50-59      60-69      70-79        80+          . |     Total
-----------+-------------------------------------------------------+----------
        14 |         0          0          0          0          8 |         8 
        22 |         0          0          0          0         16 |        16 
        24 |         0          0          0          0         24 |        24 
        25 |         0          0          0          0         40 |        40 
        26 |         0          0          0          0          8 |         8 
        27 |         0          0          0          0         40 |        40 
        28 |         0          0          0          0          8 |         8 
        29 |         0          0          0          0         48 |        48 
        30 |         0          0          0          0        120 |       120 
        31 |         0          0          0          0        176 |       176 
        32 |         0          0          0          0        120 |       120 
        33 |         0          0          0          0        120 |       120 
        34 |         0          0          0          0        200 |       200 
        35 |         1          0          0          0        231 |       232 
        36 |         1          0          0          0        303 |       304 
        37 |         5          0          0          0        259 |       264 
        38 |        10          0          0          0        430 |       440 
        39 |        12          0          0          0        540 |       552 
        40 |        33          0          0          0        775 |       808 
        41 |        52          0          0          0        996 |     1,048 
        42 |        81          0          0          0      1,351 |     1,432 
        43 |       134          0          0          0      1,602 |     1,736 
        44 |       219          9          0          0      1,748 |     1,976 
        45 |       299         18          0          0      2,619 |     2,936 
        46 |       565         37          0          0      3,406 |     4,008 
        47 |       784        103          0          0      4,689 |     5,576 
        48 |     1,325        200          0          0      5,891 |     7,416 
        49 |     1,791        405          0          0      7,492 |     9,688 
        50 |     9,720      1,583          0          0     19,449 |    30,752 
        51 |    14,847      2,633          0          0     31,176 |    48,656 
        52 |    12,666      3,000          0          0     28,902 |    44,568 
        53 |    11,117      3,582          0          0     26,181 |    40,880 
        54 |     9,835      4,608         87          0     25,942 |    40,472 
        55 |     8,971      4,965        279          0     24,937 |    39,152 
        56 |     8,233      6,320        345          0     26,390 |    41,288 
        57 |     7,218      6,653        767          0     25,914 |    40,552 
        58 |     5,261      8,071        988          0     24,960 |    39,280 
        59 |     4,766      7,765      1,157          0     24,440 |    38,128 
        60 |         0     12,432      1,680          0     25,280 |    39,392 
        61 |         0     11,504      2,098          0     24,126 |    37,728 
        62 |         0     10,677      2,511          0     23,964 |    37,152 
        63 |         0      9,965      3,150          0     22,909 |    36,024 
        64 |         0      8,652      3,898         86     22,564 |    35,200 
        65 |         0      8,040      3,985        219     22,156 |    34,400 
        66 |         0      6,570      4,897        273     20,780 |    32,520 
        67 |         0      5,742      4,977        411     20,558 |    31,688 
        68 |         0      4,227      6,024        537     20,756 |    31,544 
        69 |         0      3,825      6,171        773     19,823 |    30,592 
        70 |         0          0      9,019        951     18,278 |    28,248 
        71 |         0          0      8,226      1,213     17,897 |    27,336 
        72 |         0          0      7,480      1,431     16,977 |    25,888 
        73 |         0          0      6,514      1,696     16,070 |    24,280 
        74 |         0          0      5,562      2,242     15,236 |    23,040 
        75 |         0          0      5,043      2,229     14,560 |    21,832 
        76 |         0          0      4,087      2,644     13,693 |    20,424 
        77 |         0          0      3,463      2,674     13,263 |    19,400 
        78 |         0          0      2,537      3,352     13,055 |    18,944 
        79 |         0          0      2,156      2,884     12,208 |    17,248 
        80 |         0          0          0      4,705     11,095 |    15,800 
        81 |         0          0          0      4,003     10,013 |    14,016 
        82 |         0          0          0      3,451      8,885 |    12,336 
        83 |         0          0          0      2,975      8,041 |    11,016 
        84 |         0          0          0      2,422      7,002 |     9,424 
        85 |         0          0          0      2,058      6,246 |     8,304 
        86 |         0          0          0      1,678      5,042 |     6,720 
        87 |         0          0          0      1,349      4,355 |     5,704 
        88 |         0          0          0        936      3,224 |     4,160 
        89 |         0          0          0        767      2,681 |     3,448 
        90 |         0          0          0        595      2,261 |     2,856 
        91 |         0          0          0        483      1,917 |     2,400 
        92 |         0          0          0        273      1,071 |     1,344 
        93 |         0          0          0        213        851 |     1,064 
        94 |         0          0          0        138        566 |       704 
        95 |         0          0          0         96        384 |       480 
        96 |         0          0          0         59        237 |       296 
        97 |         0          0          0         35        165 |       200 
        98 |         0          0          0         22        114 |       136 
        99 |         0          0          0         35        173 |       208 
       100 |         0          0          0         19        109 |       128 
       101 |         0          0          0          4         20 |        24 
       102 |         0          0          0          5         27 |        32 
       103 |         0          0          0          2         14 |        16 
         . |         0          0          0          0        192 |       192 
-----------+-------------------------------------------------------+----------
     Total |    97,946    131,586     97,101     49,938    740,389 | 1,116,960 

. 
. 
. // agenotelig 
. gen age_never`agethreshold'=agemax<`agethreshold'

. tab age_never`agethreshold' ,m  

age_never50 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,098,096       98.31       98.31
          1 |     18,864        1.69      100.00
------------+-----------------------------------
      Total |  1,116,960      100.00

. 
. gen age_not`agethreshold'=age<`agethreshold'

. tab iwstatr age_not`agethreshold'

                      |       age_not50
   r interview status |         0          1 |     Total
----------------------+----------------------+----------
              0.inap. |   434,973          0 |   434,973 
        1.resp, alive |   404,553      7,052 |   411,605 
          4.nr, alive |   109,317          0 |   109,317 
   5.nr, died this wv |    17,042          0 |    17,042 
   6.nr, died prev wv |    38,756          0 |    38,756 
9.nr, dk if alive or  |   105,267          0 |   105,267 
----------------------+----------------------+----------
                Total | 1,109,908      7,052 | 1,116,960 

. 
. 
. **label variables from A (if different label desired)**
. la var  age             "age at interview"

. la var  raeducl         "r educ"

. la de   raeducll        1 "1.less than upper secondary" 2 "2.upper secondary or vocational" 3 "3.tertiary education"

. la val  raeducl raeducll

.         
. loc     droplist        "ragender"                      // drop variables not needed

. drop    `droplist'

. // B: health 
. rename  hiper osteoer

. // C: healthcare use and insurance
. // D: cognition
. // E: financial and housing Wealth
. // F: income and consumption
. 
. // G: family structure
. egen    hhreshhcat = cut(hhreshh), at (1,2,4,20) 
(733,313 missing values generated)

. tab     hhreshh hhreshhcat

 Number of |
 people in |            hhreshhcat
        HH |         1          2          4 |     Total
-----------+---------------------------------+----------
         1 |    82,848          0          0 |    82,848 
         2 |         0    215,310          0 |   215,310 
         3 |         0     49,179          0 |    49,179 
         4 |         0          0     23,355 |    23,355 
         5 |         0          0      7,983 |     7,983 
         6 |         0          0      3,228 |     3,228 
         7 |         0          0      1,149 |     1,149 
         8 |         0          0        390 |       390 
         9 |         0          0        123 |       123 
        10 |         0          0         59 |        59 
        11 |         0          0          9 |         9 
        12 |         0          0         11 |        11 
        14 |         0          0          2 |         2 
        15 |         0          0          1 |         1 
-----------+---------------------------------+----------
     Total |    82,848    264,489     36,310 |   383,647 

. la de   hhreshhcatl 1 "single HH" 2 "2-3 ppl in HH" 4 "4+ ppl in HH"

. la val  hhreshhcat hhreshhcatl

. 
. la var  hhreshhcat "# of people in HH"

. // H: employment history
. gen     disabled = (lbrfr==6) if lbrfr<.
(743,773 missing values generated)

. tab     lbrfr disabled,m

                      |             disabled
 R labor force status |         0          1          . |     Total
----------------------+---------------------------------+----------
1.employed or self-em |    96,214          0          0 |    96,214 
         3.unemployed |    10,098          0          0 |    10,098 
            5.retired |   219,147          0          0 |   219,147 
6.permanently sick or |         0     12,744          0 |    12,744 
          8.homemaker |    34,984          0          0 |    34,984 
                    . |         0          0    733,313 |   733,313 
                .d:DK |         0          0        132 |       132 
           .m:Missing |         0          0      4,776 |     4,776 
             .o:Other |         0          0      5,431 |     5,431 
            .r:Refuse |         0          0        121 |       121 
----------------------+---------------------------------+----------
                Total |   360,443     12,744    743,773 | 1,116,960 

. 
. la var  retempr "retired"

. // I: retirement (and expectations)
. // J: pension 
.         gen     pubpenhh        =       (pubpenr==1|pubpens==1) if pubpenr<. | pubpens<. /*should use "|" due to unmarried people*/
(734,804 missing values generated)

.                 la var  pubpenr  "receive public pension"

.                 la var  pubpenhh "anyone in HH receives public pension"

. // K: physical measures
. // L: assistance and caregiving
. // M: stress
. // O: (end of life planning)
. // P: (childhood)
. // Q: Psychosocial
. rename  psycher depress_selfrep /*self reported/doctor diagnosis depression*/

. loc     ptestname       "eurod"

. loc     pthreshold      "4"

. gen     psycher = (`ptestname'>=`pthreshold') if `ptestname'<.  /*validated test as indicator for depression*/
(796,561 missing values generated)

. 
. tab             depress_selfrep psycher

     R ever had |        psycher
 psych disorder |         0          1 |     Total
----------------+----------------------+----------
           0.no |   193,233     58,359 |   251,592 
          1.yes |    16,129     20,693 |    36,822 
----------------+----------------------+----------
          Total |   209,362     79,052 |   288,414 

. corr    depress_selfrep psycher /*0.25 in SHARE*/
(obs=288,414)

             | depres~p  psycher
-------------+------------------
depress_se~p |   1.0000
     psycher |   0.2469   1.0000


. 
. // Y: Other relevant variables (e.g. from other datasets)
. *gen    ageatdeath // construct ageatdeath from end-of-life version of harmonized dataset (see here https://g2aging.org/downloads) (if this is available and informative);  
. 
. 
. 
. *****************
. *** Attrition *** 
. *****************
. *use            "$myGoogle2/SHAREdata/harmon/H_panel2.dta", replace 
. tab     iwstatr

       r interview status |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
                  0.inap. |    434,973       38.94       38.94
            1.resp, alive |    411,605       36.85       75.79
              4.nr, alive |    109,317        9.79       85.58
       5.nr, died this wv |     17,042        1.53       87.11
       6.nr, died prev wv |     38,756        3.47       90.58
9.nr, dk if alive or died |    105,267        9.42      100.00
--------------------------+-----------------------------------
                    Total |  1,116,960      100.00

. gen     iwstatr0 = (iwstatr==0) if iwstatr<.

. gen     iwstatr4 = (iwstatr==4) if iwstatr<.

. gen     iwstatr9 = (iwstatr==9) if iwstatr<.

. gen     dead = (iwstatr==5|iwstatr==6) if iwstatr<. 

. bys ID: egen everdead = max(dead) // =1 if ID ever dies 

. bys ID: egen everiwstatr0 = max(iwstatr0) 

. bys ID: egen everiwstatr4 = max(iwstatr4) 

. bys ID: egen everiwstatr9 = max(iwstatr9) 

. la var  everiwstatr0 "ever inap."

. la var  everiwstatr4 "ever nr \& alive"

. la var  everiwstatr4 "ever nr, dk if alive"

. tab everdead if wave==1

   everdead |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    120,052       85.98       85.98
          1 |     19,568       14.02      100.00
------------+-----------------------------------
      Total |    139,620      100.00

. tab everdead iwstatr,m col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |                        r interview status
  everdead |   0.inap.  1.resp, a  4.nr, ali  5.nr, die  6.nr, die  9.nr, dk  |     Total
-----------+------------------------------------------------------------------+----------
         0 |   390,029    364,243    102,317          0          0    103,827 |   960,416 
           |     89.67      88.49      93.60       0.00       0.00      98.63 |     85.98 
-----------+------------------------------------------------------------------+----------
         1 |    44,944     47,362      7,000     17,042     38,756      1,440 |   156,544 
           |     10.33      11.51       6.40     100.00     100.00       1.37 |     14.02 
-----------+------------------------------------------------------------------+----------
     Total |   434,973    411,605    109,317     17,042     38,756    105,267 | 1,116,960 
           |    100.00     100.00     100.00     100.00     100.00     100.00 |    100.00 

. sum iwstatr0 iwstatr4 iwstatr9 dead

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
    iwstatr0 |  1,116,960    .3894258    .4876203          0          1
    iwstatr4 |  1,116,960    .0978701    .2971391          0          1
    iwstatr9 |  1,116,960    .0942442    .2921683          0          1
        dead |  1,116,960    .0499552    .2178526          0          1

. sum everiwstatr0 everiwstatr4 everiwstatr9 everdead     

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
everiwstatr0 |  1,116,960    .8346727    .3714759          0          1
everiwstatr4 |  1,116,960    .4421716    .4966448          0          1
everiwstatr9 |  1,116,960    .3380963    .4730617          0          1
    everdead |  1,116,960    .1401518    .3471447          0          1

. 
. loc ctrls "male i.raeducl age"

. eststo attr0: qui reg everiwstatr0 `ctrls'

. eststo attr4: qui reg everiwstatr4 `ctrls'

. eststo attr9: qui reg everiwstatr9 `ctrls'

. esttab attr*, label

--------------------------------------------------------------------
                              (1)             (2)             (3)   
                       ever inap.    ever nr, d~e    everiwstatr9   
--------------------------------------------------------------------
male                     -0.00334*        0.00340*        0.00671***
                          (-2.48)          (2.14)          (4.93)   

1.less than upper ~y            0               0               0   
                              (.)             (.)             (.)   

2.upper secondary ~l       0.0818***      -0.0532***      -0.0520***
                          (53.15)        (-29.35)        (-33.48)   

3.tertiary education       0.0404***      -0.0142***      -0.0735***
                          (22.29)         (-6.66)        (-40.20)   

age at interview         -0.00248***     -0.00573***     -0.00463***
                         (-37.58)        (-73.69)        (-69.40)   

Constant                    0.905***        0.807***        0.570***
                         (191.97)        (145.16)        (119.75)   
--------------------------------------------------------------------
Observations               383623          383623          383623   
--------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. eststo clear

. *log close log
. 
. tab iwstatr wave,m      

                      |                                       Survey Wave
   r interview status | 2004 wave  2006/07 w  2008/09 w  2011/12 w  2013 wave  2015 wave  2017 wave  2019/20 w |     Total
----------------------+----------------------------------------------------------------------------------------+----------
              0.inap. |   109,201     92,072     95,835     62,178     44,791     25,422      2,919      2,555 |   434,973 
        1.resp, alive |    30,419     37,143     27,958     58,000     66,065     68,085     77,202     46,733 |   411,605 
          4.nr, alive |         0      6,823      9,250     10,125     13,148     21,967     22,643     25,361 |   109,317 
   5.nr, died this wv |         0        892      1,236      1,317      2,412      3,013      4,235      3,937 |    17,042 
   6.nr, died prev wv |         0          0        716      2,056      3,333      6,342     10,727     15,582 |    38,756 
9.nr, dk if alive or  |         0      2,690      4,625      5,944      9,871     14,791     21,894     45,452 |   105,267 
----------------------+----------------------------------------------------------------------------------------+----------
                Total |   139,620    139,620    139,620    139,620    139,620    139,620    139,620    139,620 | 1,116,960 

. tab inw_tot everdead,m

           |       everdead
   inw_tot |         0          1 |     Total
-----------+----------------------+----------
         1 |   266,440     62,304 |   328,744 
         2 |   222,080     45,280 |   267,360 
         3 |   145,648     24,424 |   170,072 
         4 |   144,120     16,160 |   160,280 
         5 |   111,680      5,928 |   117,608 
         6 |    41,488      2,448 |    43,936 
         7 |    28,960          0 |    28,960 
-----------+----------------------+----------
     Total |   960,416    156,544 | 1,116,960 

. 
. 
. 
. sort    ID wave

. save    "`h_data'H_panel2.dta", replace 
file G:/Shared drives/sharedStudents/BScThesis/Castor/SHAREdata/harmon/H_panel2.dta saved

. pause

. 
. 
. ****************************************************************************************************
. *Part 5.1*: Sample Selection and variables (some Paper)
. ****************************************************************************************************
. *sort ID wave 
. *save "`h_data'H_panel2-SOMENAME.dta", replace 
. 
. ****************************************************************************************************
. *Part 5.2*: Sample Selection and variables (Multimorbidity Paper)
. ****************************************************************************************************
. use     "`h_data'H_panel2.dta", clear // load earlier dataset 
(Harmonized SHARE Ver.F)

. 
. 
. ************************
. *** list of diseases ***
. ************************
. 
. ***either-or condition***
. ** r has disease: either "ever told by doctor" or "currently taking med for"**
. local eitheror "hibp diab heart lung psych osteo" 

. foreach var of local eitheror { 
  2. gen     d_`var' =       `var'er==1 | rx`var'r==1           if `var'er<. | rx`var'r<. 
  3. la var  d_`var'         "ever had | taking meds for `var'"
  4. loc eitherorlist        "`eitherorlist' d_`var'" /*creates a local macro that appends new var at each iteration*/
  5. }               
(734,389 missing values generated)
(734,553 missing values generated)
(734,534 missing values generated)
(734,601 missing values generated)
(733,914 missing values generated)
(734,635 missing values generated)

.         /**check to have used correct if-condition above: "if `var'er<. | rx`var'r<.": **
>         **here we want to the variable to take value 1 if any of the two (ever had or taking meds) is 1 ///
>         * , that is, ignoring the fact that there is a missing value in one of them (one could optionally ///
>         * see if there is a nonrandom non-response of either category, or only take complete-cases (=hibp3)).
>         gen d_hibp2 = (hibper==1 | rxhibpr==1) /*ignoring missing values (here treated as 0)*/
>         gen d_hibp3 = (hibper==1 | rxhibpr==1) if hibper<. & rxhibpr<. /*set missing if both missing (>=.)*/
>         gen d_hibp4 = (hibper==1 | rxhibpr==1) if hibper<. | rxhibpr<. /*set missing if either miss (= d_hibp above)*/
>         tab d_hibp2 d_hibp3,m
>         tab d_hibp3 d_hibp4,m
>         sum hibper rxhibpr d_hibp if hibper<. & rxhibpr>=.                       /*check if either var missing*/
>         sum hibper rxhibpr d_hibp if hibper>=. & rxhibpr<.              
>         *bro ID wave hibper rxhibpr d_hibp* /*check whole sample*/
>         *bro ID wave hibper rxhibpr d_hibp* if hibper>=. | rxhibpr>=. /*check which is correct: .m and
>                                                                                                                                    *other missings are "larger" than (.) */
>         drop d_hibp2-d_hibp4 /*from this part, it is clear that d_hibp4 (=loop) is the correct of the variable*/
>         */
. 
. **# Bookmark #2 Note: left out kidney in first analysis in SHARE because this is available only from w6-w8, messing up d_miss
. **only ever had (these diseases have no medication)**
. loc onlyeverhad         "cancr strok arthr"               // kidney

. foreach var of local onlyeverhad {
  2. gen     d_`var' =       `var'er==1      if `var'er<.    /*only one condition*/
  3. la var  d_`var'         "(only) ever had `var'"
  4. loc onlyeverhadlist "`onlyeverhadlist' d_`var'" //  - /*kidney only from w6*/ 
  5. }
(734,961 missing values generated)
(734,935 missing values generated)
(734,763 missing values generated)

. 
. /**only medication (no "ever had")**
> * note: severe osteoporitic disease can be defined as "self-reported hip-fracture OR taking meds for osteoporosis, hence renamed hibper to osteoer above"
> loc onlymed     "osteo"
> loc onlymedlist "rxosteor"
> des `onlymedlist'
> sum `onlymedlist'
> foreach var of local onlymed {
> gen d_`var' = rx`var'r==1       if rx`var'r<.  // `var'er==1            // | 
> }
> */
. 
. **"any disease", # of diseases missing, # of diseases present, multimorbidity***
. loc     alldiseases "`eitherorlist' `onlyeverhadlist' `onlymedlist'"

. di              "`alldiseases'" /*(!) check all diseases are shown: if one local is empty, this is simply ignored!*/
 d_hibp d_diab d_heart d_lung d_psych d_osteo  d_cancr d_strok d_arthr 

. codebook `alldiseases', compact

Variable      Obs Unique      Mean  Min  Max  Label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
d_hibp     382571      2  .5035405    0    1  ever had | taking meds for hibp
d_diab     382407      2  .1558026    0    1  ever had | taking meds for diab
d_heart    382426      2  .2350023    0    1  ever had | taking meds for heart
d_lung     382359      2  .0906583    0    1  ever had | taking meds for lung
d_psych    383046      2  .2616239    0    1  ever had | taking meds for psych
d_osteo    382325      2  .0873236    0    1  ever had | taking meds for osteo
d_cancr    381999      2   .088351    0    1  (only) ever had cancr
d_strok    382025      2  .0643256    0    1  (only) ever had strok
d_arthr    382197      2  .3330743    0    1  (only) ever had arthr
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. egen    d_any   = rowmax(`alldiseases') // Observation (ID-wave) has any of the above diseases
(733,505 missing values generated)

. la var  d_any           "any disease"

. 
. egen    d_miss  = rowmiss(`alldiseases') /*counts number of diseases "missing" for each observation (row)*/

. replace d_miss  = . if d_any>=. /*set count to (.) if no response to any disease (or dead) */
(733,505 real changes made, 733,505 to missing)

. la var  d_miss          "# miss.diseases"

. tab     d_miss wave,m 

         # |
miss.disea |                                       Survey Wave
       ses | 2004 wave  2006/07 w  2008/09 w  2011/12 w  2013 wave  2015 wave  2017 wave  2019/20 w |     Total
-----------+----------------------------------------------------------------------------------------+----------
         0 |    30,254     36,978          0     57,686     65,837     67,930     76,409     46,592 |   381,686 
         1 |         0          0          0          0          2          0        267          3 |       272 
         2 |         0          3          0          0          8          5         31         11 |        58 
         3 |        19         36          0         21         48          9        144         16 |       293 
         4 |         0          1          0          1          7          3          7         14 |        33 
         5 |         0          4          0          5         16         13         15         16 |        69 
         6 |         0          4          0          7         15         20         33         24 |       103 
         7 |         0         16          0         22         21         28         36         27 |       150 
         8 |       146        101          0        258        111         77         68         30 |       791 
         . |   109,201    102,477    139,620     81,620     73,555     71,535     62,610     92,887 |   733,505 
-----------+----------------------------------------------------------------------------------------+----------
     Total |   139,620    139,620    139,620    139,620    139,620    139,620    139,620    139,620 | 1,116,960 

. li              ID wave age `alldiseases' d_any d_miss     in 1/3

     +---------------------------------------------------------------------------------------------------------------------------------+
     | ID           wave   age   d_hibp   d_diab   d_heart   d_lung   d_psych   d_osteo   d_cancr   d_strok   d_arthr   d_any   d_miss |
     |---------------------------------------------------------------------------------------------------------------------------------|
  1. |  1      2004 wave    51        0        0         0        0         0         0         0         0         0       0        0 |
  2. |  1   2006/07 wave    54        0        0         0        0         1         0         1         0         0       1        0 |
  3. |  1   2008/09 wave     .        .        .         .        .         .         .         .         .         .       .        . |
     +---------------------------------------------------------------------------------------------------------------------------------+

. 
. egen    d_count = rowtotal(`alldiseases') , missing /*(row) sum of the variables in varlist*/
(733,505 missing values generated)

. la var  d_count         "# diseases"    

. tab     d_count wave,m

           |                                       Survey Wave
# diseases | 2004 wave  2006/07 w  2008/09 w  2011/12 w  2013 wave  2015 wave  2017 wave  2019/20 w |     Total
-----------+----------------------------------------------------------------------------------------+----------
         0 |    10,022     10,599          0     13,934     14,992     13,447     16,514      6,987 |    86,495 
         1 |     9,248     10,583          0     16,084     17,845     17,347     19,851     10,589 |   101,547 
         2 |     5,885      7,594          0     12,356     14,442     14,929     17,063     10,703 |    82,972 
         3 |     3,137      4,577          0      8,033      9,300     10,630     12,069      8,300 |    56,046 
         4 |     1,413      2,340          0      4,558      5,468      6,523      6,694      5,392 |    32,388 
         5 |       529      1,040          0      2,084      2,611      3,336      3,188      3,020 |    15,808 
         6 |       152        315          0        739      1,033      1,350      1,220      1,228 |     6,037 
         7 |        28         79          0        177        316        438        338        417 |     1,793 
         8 |         5         15          0         32         49         77         70         88 |       336 
         9 |         0          1          0          3          9          8          3          9 |        33 
         . |   109,201    102,477    139,620     81,620     73,555     71,535     62,610     92,887 |   733,505 
-----------+----------------------------------------------------------------------------------------+----------
     Total |   139,620    139,620    139,620    139,620    139,620    139,620    139,620    139,620 | 1,116,960 

. li              ID wave age `alldiseases' d_any d_count     in 1/3

     +----------------------------------------------------------------------------------------------------------------------------------+
     | ID           wave   age   d_hibp   d_diab   d_heart   d_lung   d_psych   d_osteo   d_cancr   d_strok   d_arthr   d_any   d_count |
     |----------------------------------------------------------------------------------------------------------------------------------|
  1. |  1      2004 wave    51        0        0         0        0         0         0         0         0         0       0         0 |
  2. |  1   2006/07 wave    54        0        0         0        0         1         0         1         0         0       1         2 |
  3. |  1   2008/09 wave     .        .        .         .        .         .         .         .         .         .       .         . |
     +----------------------------------------------------------------------------------------------------------------------------------+

.         tab     d_count d_miss,m 

           |                                                # miss.diseases
# diseases |         0          1          2          3          4          5          6          7          8          . |     Total
-----------+--------------------------------------------------------------------------------------------------------------+----------
         0 |    85,725         79          0        171          0          0          0          0        520          0 |    86,495 
         1 |   101,047         78         10         65          0          0          0         76        271          0 |   101,547 
         2 |    82,745         46         20         34          0          0         53         74          0          0 |    82,972 
         3 |    55,893         36         18         13          0         36         50          0          0          0 |    56,046 
         4 |    32,308         19          7          5         16         33          0          0          0          0 |    32,388 
         5 |    15,777         10          2          2         17          0          0          0          0          0 |    15,808 
         6 |     6,031          3          0          3          0          0          0          0          0          0 |     6,037 
         7 |     1,791          1          1          0          0          0          0          0          0          0 |     1,793 
         8 |       336          0          0          0          0          0          0          0          0          0 |       336 
         9 |        33          0          0          0          0          0          0          0          0          0 |        33 
         . |         0          0          0          0          0          0          0          0          0    733,505 |   733,505 
-----------+--------------------------------------------------------------------------------------------------------------+----------
     Total |   381,686        272         58        293         33         69        103        150        791    733,505 | 1,116,960 

.         replace d_count = . if d_miss!=0 /*only compute count for observations that have no missing disease*/
(1,769 real changes made, 1,769 to missing)

.         
. 
. **multimorbidity**
. gen     d_count_geq2 = d_count>=2 if !mi(d_count)
(735,274 missing values generated)

. la var  d_count_geq2 ">=2 diseases"     

. tab     d_count d_count_geq2    

           |     >=2 diseases
# diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    85,725          0 |    85,725 
         1 |   101,047          0 |   101,047 
         2 |         0     82,745 |    82,745 
         3 |         0     55,893 |    55,893 
         4 |         0     32,308 |    32,308 
         5 |         0     15,777 |    15,777 
         6 |         0      6,031 |     6,031 
         7 |         0      1,791 |     1,791 
         8 |         0        336 |       336 
         9 |         0         33 |        33 
-----------+----------------------+----------
     Total |   186,772    194,914 |   381,686 

. li              ID d_any d_miss d_count d_count_geq2 in 1/5

     +------------------------------------------+
     | ID   d_any   d_miss   d_count   d_coun~2 |
     |------------------------------------------|
  1. |  1       0        0         0          0 |
  2. |  1       1        0         2          1 |
  3. |  1       .        .         .          . |
  4. |  1       .        .         .          . |
  5. |  1       .        .         .          . |
     +------------------------------------------+

. table   (var) wave, statistic(mean d_any d_miss d_count d_count_geq2) stat(max d_any d_miss d_count d_count_geq2)

---------------------------------------------------------------------------------------------------------------------------------------
                |                                                       Survey Wave                                                    
                |  2004 wave   2006/07 wave   2008/09 wave   2011/12 wave   2013 wave   2015 wave   2017 wave   2019/20 wave      Total
----------------+----------------------------------------------------------------------------------------------------------------------
any disease     |                                                                                                                      
  Mean          |   .6705349       .7146434              .       .7597586     .773072    .8024969    .7855603       .8504911   .7744325
  Maximum value |          1              1              .              1           1           1           1              1          1
# miss.diseases |                                                                                                                      
  Mean          |   .0402709       .0291307              .       .0405517    .0211156    .0153631    .0241267       .0167334   .0254006
  Maximum value |          8              8              .              8           8           8           8              8          8
# diseases      |                                                                                                                      
  Mean          |   1.316256       1.528395              .       1.722064    1.795343    1.965671    1.862202       2.239569   1.818356
  Maximum value |          8              9              .              9           9           9           9              9          9
>=2 diseases    |                                                                                                                      
  Mean          |   .3684802       .4308237              .       .4845543    .5038352    .5481672    .5287597       .6239912   .5106658
  Maximum value |          1              1              .              1           1           1           1              1          1
---------------------------------------------------------------------------------------------------------------------------------------

. 
. **d_count_diff: if one has c diseases, does he keep the disease or does it disappear again?**   
. bys ID: gen     d_count_diff      = d_count - L.d_count
(917,150 missing values generated)

. bys ID: gen     d_count_diff_miss = d_count - L.d_count
(917,150 missing values generated)

. bys ID: replace d_count_diff_miss = d_count - L2.d_count if L.d_count>=. & mi(d_count_diff_miss) /*L2 necessary if missing t (e.g. w3 in SHARE)*/  
(29,332 real changes made)

. bys ID: replace d_count_diff_miss = d_count - L3.d_count if L2.d_count>=. & mi(d_count_diff_miss)
(9,284 real changes made)

. *note: could go further, but if gaps are longer than 4-6y I no longer consider them "first" differences 
. *bro ID wave d_count d_count_diff d_count_diff_miss
. la var  d_count_diff            "# of diseases 1st diff"

. la var  d_count_diff_miss       "# of diseases 1nd diff (gaps adjusted)"

. tab     d_count_diff d_count_diff_miss,m

      # of |
  diseases |                                                     # of diseases 1nd diff (gaps adjusted)
  1st diff |        -4         -3         -2         -1          0          1          2          3          4          5          6          7          . |     Total
-----------+-----------------------------------------------------------------------------------------------------------------------------------------------+----------
        -4 |         3          0          0          0          0          0          0          0          0          0          0          0          0 |         3 
        -3 |         0         82          0          0          0          0          0          0          0          0          0          0          0 |        82 
        -2 |         0          0      1,679          0          0          0          0          0          0          0          0          0          0 |     1,679 
        -1 |         0          0          0     22,646          0          0          0          0          0          0          0          0          0 |    22,646 
         0 |         0          0          0          0    112,540          0          0          0          0          0          0          0          0 |   112,540 
         1 |         0          0          0          0          0     46,423          0          0          0          0          0          0          0 |    46,423 
         2 |         0          0          0          0          0          0     12,762          0          0          0          0          0          0 |    12,762 
         3 |         0          0          0          0          0          0          0      2,965          0          0          0          0          0 |     2,965 
         4 |         0          0          0          0          0          0          0          0        629          0          0          0          0 |       629 
         5 |         0          0          0          0          0          0          0          0          0         65          0          0          0 |        65 
         6 |         0          0          0          0          0          0          0          0          0          0         14          0          0 |        14 
         7 |         0          0          0          0          0          0          0          0          0          0          0          2          0 |         2 
         . |         0         20        375      4,108     18,641     10,187      3,826      1,113        265         58         21          2    878,534 |   917,150 
-----------+-----------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |         3        102      2,054     26,754    131,181     56,610     16,588      4,078        894        123         35          4    878,534 | 1,116,960 

. tab     d_count          d_count_diff_miss,m

           |                                                     # of diseases 1nd diff (gaps adjusted)
# diseases |        -4         -3         -2         -1          0          1          2          3          4          5          6          7          . |     Total
-----------+-----------------------------------------------------------------------------------------------------------------------------------------------+----------
         0 |         0          9        220      5,301     37,110          0          0          0          0          0          0          0     43,085 |    85,725 
         1 |         1         23        477      7,372     37,575     13,649          0          0          0          0          0          0     41,950 |   101,047 
         2 |         2         38        567      6,382     26,755     16,292      3,936          0          0          0          0          0     28,773 |    82,745 
         3 |         0         25        483      4,233     15,930     12,647      4,933      1,036          0          0          0          0     16,606 |    55,893 
         4 |         0          6        201      2,243      8,303      7,809      3,910      1,349        300          0          0          0      8,187 |    32,308 
         5 |         0          1         87        901      3,735      4,013      2,362        996        326         45          0          0      3,311 |    15,777 
         6 |         0          0         16        270      1,328      1,610      1,030        463        183         54         18          0      1,059 |     6,031 
         7 |         0          0          3         43        376        492        343        193         70         14         13          2        242 |     1,791 
         8 |         0          0          0          9         65         91         62         37         13          9          4          2         44 |       336 
         9 |         0          0          0          0          4          7         12          4          2          1          0          0          3 |        33 
         . |         0          0          0          0          0          0          0          0          0          0          0          0    735,274 |   735,274 
-----------+-----------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |         3        102      2,054     26,754    131,181     56,610     16,588      4,078        894        123         35          4    878,534 | 1,116,960 

. sum     d_count_diff*

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
d_count_diff |    199,810    .2878685    .8665464         -4          7
d_count_di~s |    238,426    .3156912    .8942706         -4          7

. 
. **index of disease**
. su              d_count, meanonly

. local   d_countmax = r(max) // number of chosen diseases, max of variable

. gen     d_count_index = d_count / `d_countmax'
(735,274 missing values generated)

. sum     d_count_index, de 

                        d_count_index
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs             381,686
25%     .1111111              0       Sum of wgt.     381,686

50%     .2222222                      Mean           .2020396
                        Largest       Std. dev.      .1718892
75%     .3333333              1
90%     .4444444              1       Variance       .0295459
95%     .5555556              1       Skewness       .8118948
99%     .6666667              1       Kurtosis       3.272395

. la var  d_count_index           "disease index (=count/total diseases)"

.         
. **age at first onset (any chronic disease observed)**
. gen     myvar           = age if d_any==1 /*age, if any disease is present*/
(820,008 missing values generated)

. bys ID: egen d_firstage = min(myvar)
(202,168 missing values generated)

. drop    myvar

. sort    ID wave

. li              ID wave age d_any d_firstage in 1/16 /*check correct generation*/

     +--------------------------------------------+
     | ID           wave   age   d_any   d_firs~e |
     |--------------------------------------------|
  1. |  1      2004 wave    51       0         54 |
  2. |  1   2006/07 wave    54       1         54 |
  3. |  1   2008/09 wave     .       .         54 |
  4. |  1   2011/12 wave     .       .         54 |
  5. |  1      2013 wave     .       .         54 |
     |--------------------------------------------|
  6. |  1      2015 wave     .       .         54 |
  7. |  1      2017 wave     .       .         54 |
  8. |  1   2019/20 wave     .       .         54 |
  9. |  2      2004 wave    48       0         51 |
 10. |  2   2006/07 wave    51       1         51 |
     |--------------------------------------------|
 11. |  2   2008/09 wave     .       .         51 |
 12. |  2   2011/12 wave     .       .         51 |
 13. |  2      2013 wave     .       .         51 |
 14. |  2      2015 wave     .       .         51 |
 15. |  2      2017 wave     .       .         51 |
     |--------------------------------------------|
 16. |  2   2019/20 wave     .       .         51 |
     +--------------------------------------------+

. la var  d_firstage      "age of first onset (observed)"

. 
. 
.         **age at first onset, for each disease separately:**
.         foreach d of local alldiseases {
  2.         gen     first_age               = age if `d'==1
  3.         bys ID: egen d_firstage_`d' = min(first_age)
  4.         drop    first_age
  5.         la var  d_firstage_`d' "age of first onset (observed) for `d'"
  6.         loc     d_firstagelist "`d_firstagelist' d_firstage_`d'" 
  7.         }
(924,322 missing values generated)
(503,360 missing values generated)
(1,057,381 missing values generated)
(918,008 missing values generated)
(1,027,089 missing values generated)
(782,032 missing values generated)
(1,082,297 missing values generated)
(997,168 missing values generated)
(1,016,750 missing values generated)
(648,928 missing values generated)
(1,083,575 missing values generated)
(967,464 missing values generated)
(1,083,210 missing values generated)
(1,001,024 missing values generated)
(1,092,386 missing values generated)
(1,027,496 missing values generated)
(989,662 missing values generated)
(715,768 missing values generated)

.         li              ID wave age d_firstage d_firstage_* in 1/2 

     +---------------------------------------------------------------------------------------------------------------------------------------+
     | ID           wave   age   d_firs~e   d_firs~p   d_firs~b   d_firs~t   d_firs~g   d_firs~h   d_firs~o   d_fir~cr   d_firs~k   d_fir~hr |
     |---------------------------------------------------------------------------------------------------------------------------------------|
  1. |  1      2004 wave    51         54          .          .          .          .         54          .         54          .          . |
  2. |  1   2006/07 wave    54         54          .          .          .          .         54          .         54          .          . |
     +---------------------------------------------------------------------------------------------------------------------------------------+

.         codebook d_firstage_*, compact /*this is the first onset for each disease separately, but a different 
>                                                                         age could also be the result of the one disease "missing", while others 
>                                                                         were present in a given year. To remedy this issue, should delete
>                                                                         observations who had one or more missing diseases.*/

Variable         Obs Unique      Mean  Min  Max  Label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
d_firstage~p  613600     73   67.4791   22  103  age of first onset (observed) for d_hibp
d_firstage~b  198952     65  68.53074   37  103  age of first onset (observed) for d_diab
d_firstage~t  334928     71  70.75188   29  103  age of first onset (observed) for d_heart
d_firstage~g  119792     69   68.7515   22  103  age of first onset (observed) for d_lung
d_firstage~h  468032     79  66.83512   25  105  age of first onset (observed) for d_psych
d_firstage~o  149496     67  70.33975   34  104  age of first onset (observed) for d_osteo
d_firstag~cr  115936     68   68.8789   33  103  age of first onset (observed) for d_cancr
d_firstage~k   89464     61  72.29142   35  103  age of first onset (observed) for d_strok
d_firstag~hr  401192     68   67.9933   35  102  age of first onset (observed) for d_arthr
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

.         
. **age of first onset (g2aging version - self-reported age at first diagnosis)**
. loc     locallist "`eitheror' `onlyeverhad' `onlymed'" 

. di              "`locallist'"
hibp diab heart lung psych osteo cancr strok arthr 

. foreach v of local locallist {
  2. loc     radiaglist "`radiaglist' radiag`v'" 
  3. }

. di              "`radiaglist'" /*same list as `d_agediag' in harmon file*/
 radiaghibp radiagdiab radiagheart radiaglung radiagpsych radiagosteo radiagcancr radiagstrok radiagarthr

. sum     `radiaglist'

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  radiaghibp |    366,040    53.04153    12.78939          0         94
  radiagdiab |    114,256     55.8022    12.76982          0         97
 radiagheart |    126,456    56.50952    15.13659          0         96
  radiaglung |     56,176    46.87924    20.14729          0         92
 radiagpsych |     19,360    45.87975    18.13894          0         91
-------------+---------------------------------------------------------
 radiagosteo |     30,704    57.86165     12.2275          0         90
 radiagcancr |     60,728    57.90304    13.40544          0        101
 radiagstrok |     41,704    61.16075    13.99055          0         99
 radiagarthr |    208,856    51.31118    15.12005          0         93

. egen    d_firstage_g2 = rowmin(`radiaglist')    /*earliest reported age for any of the diseases*/
(504,864 missing values generated)

. la var  d_firstage_g2 "age of first onset (g2aging)"

. li              ID wave d_any age d_firstage d_firstage_g2 in 10/20

     +-------------------------------------------------------+
     | ID           wave   d_any   age   d_firs~e   d_firs~2 |
     |-------------------------------------------------------|
 10. |  2   2006/07 wave       1    51         51          . |
 11. |  2   2008/09 wave       .     .         51          . |
 12. |  2   2011/12 wave       .     .         51          . |
 13. |  2      2013 wave       .     .         51          . |
 14. |  2      2015 wave       .     .         51          . |
     |-------------------------------------------------------|
 15. |  2      2017 wave       .     .         51          . |
 16. |  2   2019/20 wave       .     .         51          . |
 17. |  3      2004 wave       .     .         59         55 |
 18. |  3   2006/07 wave       .     .         59         55 |
 19. |  3   2008/09 wave       .     .         59         55 |
     |-------------------------------------------------------|
 20. |  3   2011/12 wave       1    59         59         55 |
     +-------------------------------------------------------+

. 
. **any disease at baseline (= when first observed)**
. gen     myvar = (d_any==1 & wave==inw_first) if d_any<. /*if any D and time is equal to first observed time*/
(733,505 missing values generated)

. bys ID: egen d_anyatfirstobs = max(myvar)
(896 missing values generated)

. drop    myvar

. la var  d_anyatfirstobs "already has disease at baseline"

. tab     d_anyatfirstobs  d_any if wave==1       /*checked correct generation*/

   already |
       has |
disease at |      any disease
  baseline |         0          1 |     Total
-----------+----------------------+----------
         0 |    10,022          2 |    10,024 
         1 |         0     20,395 |    20,395 
-----------+----------------------+----------
     Total |    10,022     20,397 |    30,419 

. sum     d_anyatfirstobs 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
d_anyatfir~s |  1,116,064    .6937452    .4609371          0          1

. 
. **any disease ever (observed)**
. bys ID: egen d_anyever = max(d_any) // ever reported having a disease
(896 missing values generated)

. la var  d_anyever               "ever reports any disease"

. 
. **any disease ever (g2aging)**
. gen     d_anyever_g2 = (d_firstage_g2<.) /*note: d_firstage_g2 is time-constant*/

. la var  d_anyever_g2    "ever reports having had any disease (g2aging)"

. sum     d_anyever d_anyever_g2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   d_anyever |  1,116,064    .8197164    .3844236          0          1
d_anyever_g2 |  1,116,960    .5480017    .4976907          0          1

. 
. 
. ** post indicator after first onset (observed) **
. gen post = (age>d_firstage) if age<.
(733,337 missing values generated)

.         
. *****************
. *** Durations ***
. *****************
. su              d_count, meanonly

. local   d_countmax = r(max)

. 
. **first onset DATE for each disease "count"**
. di                 "`d_countmax'" /*max. count of diseases defined above*/
9

. forval  j=1/`d_countmax' { /*use maximum count of disease list*/
  2. gen              myvar  = iwym if d_count>=`j' & !mi(d_count) /*iw date if C disease(s) present: only uses obs with no missing count*/
  3. bys ID: egen d_firstdate_c`j'   = min(myvar)
  4. format           d_firstdate_c`j' %tm
  5. drop             myvar
  6. la var           d_firstdate_c`j' "first date of iw with (>=`count') diseases"
  7. }
(820,999 missing values generated)
(203,496 missing values generated)
(922,046 missing values generated)
(462,936 missing values generated)
(1,004,791 missing values generated)
(703,336 missing values generated)
(1,060,684 missing values generated)
(888,360 missing values generated)
(1,092,992 missing values generated)
(1,009,320 missing values generated)
(1,108,769 missing values generated)
(1,076,536 missing values generated)
(1,114,800 missing values generated)
(1,105,264 missing values generated)
(1,116,591 missing values generated)
(1,114,736 missing values generated)
(1,116,927 missing values generated)
(1,116,728 missing values generated)

. li                      ID wave dead d_count iwym d_firstdate_c* in 100/116, compress nola /*check*/

     +------------------------------------------------------------------------------------------------------------------+
     | ID   wave   dead   d_c~t      iwym   d_fir~1   d_fi~c2   d_fir~3   d_f~4   d_f~5   d_f~6   d_f~7   d_f~8   d_f~9 |
     |------------------------------------------------------------------------------------------------------------------|
100. | 13      4      0       0    2011m8   2013m10    2015m9    2015m9       .       .       .       .       .       . |
101. | 13      5      0       1   2013m10   2013m10    2015m9    2015m9       .       .       .       .       .       . |
102. | 13      6      0       3    2015m9   2013m10    2015m9    2015m9       .       .       .       .       .       . |
103. | 13      7      0       3    2017m7   2013m10    2015m9    2015m9       .       .       .       .       .       . |
104. | 13      8      0       3    2020m1   2013m10    2015m9    2015m9       .       .       .       .       .       . |
     |------------------------------------------------------------------------------------------------------------------|
105. | 14      1      0       .         .    2015m9         .         .       .       .       .       .       .       . |
106. | 14      2      0       .         .    2015m9         .         .       .       .       .       .       .       . |
107. | 14      3      0       .         .    2015m9         .         .       .       .       .       .       .       . |
108. | 14      4      0       0    2011m8    2015m9         .         .       .       .       .       .       .       . |
109. | 14      5      0       .   2013m10    2015m9         .         .       .       .       .       .       .       . |
     |------------------------------------------------------------------------------------------------------------------|
110. | 14      6      0       1    2015m9    2015m9         .         .       .       .       .       .       .       . |
111. | 14      7      0       0    2017m7    2015m9         .         .       .       .       .       .       .       . |
112. | 14      8      0       0    2020m1    2015m9         .         .       .       .       .       .       .       . |
113. | 15      1      0       .         .   2011m12   2011m12   2011m12       .       .       .       .       .       . |
114. | 15      2      0       .         .   2011m12   2011m12   2011m12       .       .       .       .       .       . |
     |------------------------------------------------------------------------------------------------------------------|
115. | 15      3      0       .         .   2011m12   2011m12   2011m12       .       .       .       .       .       . |
116. | 15      4      0       3   2011m12   2011m12   2011m12   2011m12       .       .       .       .       .       . |
     +------------------------------------------------------------------------------------------------------------------+

. 
. **duration from c to c+1[+ / or more]** 
. *note: [there may be gaps of nonresponse, i.e. diseases could jump from 1 to 4 or 2 to 7, because either nonresponse or jump from c to c+2]: if panel not balanced in disease count or there is a real jump, this could cause additional imprecision*
. *note: some people have x count at t, then x-1 count at t+1*
. forval  j=2/`d_countmax'{
  2. loc     i=`j'-1
  3. gen     time_c`i'toc`j' = d_firstdate_c`j'-d_firstdate_c`i'
  4. la var  time_c`i'toc`j' "months (observed) `i' to `j'+ diseases"
  5. }
(462,936 missing values generated)
(703,336 missing values generated)
(888,360 missing values generated)
(1,009,320 missing values generated)
(1,076,536 missing values generated)
(1,105,264 missing values generated)
(1,114,736 missing values generated)
(1,116,728 missing values generated)

. li              ID wave iwym d_count d_firstdate_c? time_c?toc? in 85/100 , compress

     +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
     | ID           wave     iwym   d_c~t   d_fir~1   d_f~c2   d_fi~3   d_fi~4   d_f~5   d_f~6   d_f~7   d_f~8   d_f~9   tim~2   tim~3   tim~4   tim~5   tim~6   tim~7   tim~8   tim~9 |
     |---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
 85. | 11      2013 wave        .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 86. | 11      2015 wave        .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 87. | 11      2017 wave        .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 88. | 11   2019/20 wave        .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 89. | 12      2004 wave   2004m8       4    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
     |---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
 90. | 12   2006/07 wave   2007m3       2    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 91. | 12   2008/09 wave        .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 92. | 12   2011/12 wave        .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 93. | 12      2013 wave        .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 94. | 12      2015 wave        .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
     |---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
 95. | 12      2017 wave        .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 96. | 12   2019/20 wave        .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 97. | 13      2004 wave        .       .   2013m10   2015m9   2015m9        .       .       .       .       .       .      23       0       .       .       .       .       .       . |
 98. | 13   2006/07 wave        .       .   2013m10   2015m9   2015m9        .       .       .       .       .       .      23       0       .       .       .       .       .       . |
 99. | 13   2008/09 wave        .       .   2013m10   2015m9   2015m9        .       .       .       .       .       .      23       0       .       .       .       .       .       . |
     |---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
100. | 13   2011/12 wave   2011m8       0   2013m10   2015m9   2015m9        .       .       .       .       .       .      23       0       .       .       .       .       .       . |
     +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

. li              ID wave iwym d_count d_firstdate_c? time_c?toc? in 50/100 if (inw_miss==0 | everdead==1), compress

     +----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
     | ID           wave      iwym   d_c~t   d_fir~1   d_f~c2   d_fi~3   d_fi~4   d_f~5   d_f~6   d_f~7   d_f~8   d_f~9   tim~2   tim~3   tim~4   tim~5   tim~6   tim~7   tim~8   tim~9 |
     |----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
 81. | 11      2004 wave         .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 82. | 11   2006/07 wave         .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 83. | 11   2008/09 wave         .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 84. | 11   2011/12 wave   2011m12       1   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 85. | 11      2013 wave         .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
     |----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
 86. | 11      2015 wave         .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 87. | 11      2017 wave         .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 88. | 11   2019/20 wave         .       .   2011m12        .        .        .       .       .       .       .       .       .       .       .       .       .       .       .       . |
 89. | 12      2004 wave    2004m8       4    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 90. | 12   2006/07 wave    2007m3       2    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
     |----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
 91. | 12   2008/09 wave         .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 92. | 12   2011/12 wave         .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 93. | 12      2013 wave         .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 94. | 12      2015 wave         .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
 95. | 12      2017 wave         .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
     |----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
 96. | 12   2019/20 wave         .       .    2004m8   2004m8   2004m8   2004m8       .       .       .       .       .       0       0       0       .       .       .       .       . |
     +----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

. 
. **duration from c to c+1 [+ / or more] (time-varying single variable)** 
. **note: with and without adjusting for firstdate>=iwym**
. gen time_tonextdisease  = .
(1,116,960 missing values generated)

. gen time_tonextdisease2 = .
(1,116,960 missing values generated)

. forval  j=1/`d_countmax'{
  2. loc     i=`j'-1
  3. replace time_tonextdisease  = -iwym + d_firstdate_c`j' if d_count==`i'  
  4. replace time_tonextdisease2 = -iwym + d_firstdate_c`j' if d_count==`i' & d_firstdate_c`j'>= iwym /*set time_tonextdisease2 to missing if firstdate with some count is smaller than the current date / e.g. if had 2 diseases, then after that went back
>  to 1*/
  5. }       
(36,314 real changes made)
(27,562 real changes made)
(43,208 real changes made)
(31,388 real changes made)
(33,646 real changes made)
(23,667 real changes made)
(20,421 real changes made)
(13,866 real changes made)
(10,308 real changes made)
(6,888 real changes made)
(4,023 real changes made)
(2,687 real changes made)
(1,164 real changes made)
(794 real changes made)
(216 real changes made)
(153 real changes made)
(22 real changes made)
(10 real changes made)

. sum time_tonextdisease*, de

                     time_tonextdisease
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -129           -190
 5%          -79           -190
10%          -54           -190       Obs             149,322
25%          -22           -189       Sum of wgt.     149,322

50%           27                      Mean           20.94373
                        Largest       Std. dev.      56.26469
75%           52            190
90%           81            190       Variance       3165.716
95%          104            190       Skewness      -.4513351
99%          153            190       Kurtosis       3.552529

                     time_tonextdisease2
-------------------------------------------------------------
      Percentiles      Smallest
 1%           17             11
 5%           20             11
10%           22             11       Obs             107,015
25%           26             11       Sum of wgt.     107,015

50%           42                      Mean           50.02174
                        Largest       Std. dev.      31.66961
75%           68            190
90%           99            190       Variance       1002.964
95%          111            190       Skewness       1.474531
99%          155            190       Kurtosis        5.13411

.         li ID wave d_count iwym d_firstdate_c? time_tonextdisease* time_c1toc2 time_c2toc3 if ID==785 // when the disease count decreases, time_tonextdisease2 is missing

         +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
         |  ID           wave   d_count      iwym   d_firs~1   d_fir~c2   d_firs~3   d_firs~4   d_firs~5   d_firs~6   d_firs~7   d_firs~8   d_firs~9   time_t~e   time_t~2   time_c~2   time_c~3 |
         |---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
   6273. | 785      2004 wave         2    2004m5     2004m5     2004m5     2017m8     2017m8     2017m8          .          .          .          .        159        159          0        159 |
   6274. | 785   2006/07 wave         1    2007m1     2004m5     2004m5     2017m8     2017m8     2017m8          .          .          .          .        -32          .          0        159 |
   6275. | 785   2008/09 wave         .         .     2004m5     2004m5     2017m8     2017m8     2017m8          .          .          .          .          .          .          0        159 |
   6276. | 785   2011/12 wave         1    2011m3     2004m5     2004m5     2017m8     2017m8     2017m8          .          .          .          .        -82          .          0        159 |
   6277. | 785      2013 wave         1    2013m6     2004m5     2004m5     2017m8     2017m8     2017m8          .          .          .          .       -109          .          0        159 |
         |---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
   6278. | 785      2015 wave         2    2015m6     2004m5     2004m5     2017m8     2017m8     2017m8          .          .          .          .         26         26          0        159 |
   6279. | 785      2017 wave         5    2017m8     2004m5     2004m5     2017m8     2017m8     2017m8          .          .          .          .          .          .          0        159 |
   6280. | 785   2019/20 wave         4   2019m11     2004m5     2004m5     2017m8     2017m8     2017m8          .          .          .          .        -27          .          0        159 |
         +---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

.         sum time_tonextdisease* time_c1toc2 if d_count==1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
time_tonex~e |     43,208    21.84959    56.57257       -189        190
time_tonex~2 |     31,388    50.27281    31.92988         11        190
 time_c1toc2 |     43,208    51.93367    43.92826          0        190

.         *bro ID wave d_count iwym time_tonextdisease* time_c1toc2
.         *bro ID wave d_count iwym d_firstdate_c? time_tonextdisease*    
.         *bro ID wave d_count iwym d_firstdate_c? time_tonextdisease* if sbalanced       
.         *bro ID wave d_count iwym d_firstdate_c? time_tonextdisease* if sbalanced & time_tonextdisease<0        
.         // time_tonextdisease can be negative if count decreases from t to t+1
.         // currently, time_tonextdisease2 still ignores the dose: it treats time from 1 to 2 the same as 1 to 4 (2nd accumulates faster) || if sb jumps from 2 to 4, d_firstdate_c3 is equal to d_firstdate_c4 anyway || hence, this measure is simple "to
>  next '1 or more' diseases"
. 
.         
. 
. /**duration from *first* onset to death**
> gen     time_onsettodeath =  radym-d_firstdate_c1
> gen     time_onsettodeathx = raxym-d_firstdate_c1 // using rax variable
> replace time_onsettodeath =  time_onsettodeath/12 // convert to years
> replace time_onsettodeathx = time_onsettodeathx/12
> la var  time_onsettodeath "years first onset to death (observed)" 
> *bro ID wave radyear raxyear time_ons* d_firstyear_c1 d_firstdate_c1 d_any if time_onsettodeathx<0 /*using rad seems more correct than rax, bc no negative values*/
> gen     time_onsettodeath_age           = radage-d_firstage 
> gen     time_onsettodeath_age_g2        = radage-d_firstage_g2
> sum     radage radyear radmonth raxyear raxmonth time_*
> li              ID wave iwym dead d_count d_firstdate_c1 d_firstdate_c2 ra?ym time_onsettodeath* in 1/16, compress nola
> *bro    ID wave iwym dead d_count d_firstdate_c1 d_firstdate_c2 ra?ym time_onsettodeath*  if time_onsettodeath<0
> *++
> */      
. 
. /**comparison ageatdeath with g2aging variable radage: not identical. why?**
> gen     ageatdeath = radym - rabym
> replace ageatdeath = ageatdeath/12
> gen     ageatdeathx = raxym - rabym /*generally rax is correct*/
> replace ageatdeathx = ageatdeathx/12
> sum     ageatdeath ageatdeathx radage
> drop    ageatdeath ageatdeathx
> ++
> */
. 
. 
. *[to be added more from part 6]
. 
. 
. *****************************
. *** Sample Selection (MM) ***
. *****************************
. *log using      "$myGoogle2/logs/log-sampleSelection.txt", text replace name(logSampleselection)
. tab hacohort inw1, 

                      |      inw1: =1 if
     hacohort: Sample |     respondent w1
               cohort | 0.nonresp  1.resp,al |     Total
----------------------+----------------------+----------
1.Original sample for |   353,584    243,352 |   596,936 
2.2006 Refreshment sa |    69,544          0 |    69,544 
3.2010 Refreshment sa |   186,408          0 |   186,408 
4.2013 Refreshment sa |   165,288          0 |   165,288 
5.2015 Refreshment sa |    68,952          0 |    68,952 
6.2017 Refreshment sa |    29,832          0 |    29,832 
----------------------+----------------------+----------
                Total |   873,608    243,352 | 1,116,960 

. tab countryID hacohort,m                

           |                      hacohort: Sample cohort
 countryID | 1.Origina  2.2006 Re  3.2010 Re  4.2013 Re  5.2015 Re  6.2017 Re |     Total
-----------+------------------------------------------------------------------+----------
        AT |    13,688          0     36,408          0          0          0 |    50,096 
        BG |    16,128          0          0          0          0          0 |    16,128 
        Bf |    10,384      2,224     14,552      7,184      4,168          0 |    38,512 
        Bn |    21,432          0     10,104      4,472      4,544          0 |    40,552 
        CY |    10,168          0          0          0          0          0 |    10,168 
        CZ |    22,768          0     35,352     10,984          0          0 |    69,104 
        Cf |     1,616      1,704      5,584          0          0          0 |     8,904 
        Cg |     6,424      4,536     15,680          0          0          0 |    26,640 
        Ci |       528        176        720          0          0          0 |     1,424 
        DE |    25,392      7,576          0     37,400          0          0 |    70,368 
        DK |    14,272     11,000      3,712     15,936      2,056          0 |    46,976 
        EE |    57,232          0          0          0      5,392          0 |    62,624 
        ES |    24,088      3,704     14,904          0          0          0 |    42,696 
        Eg |         0          0          0     27,880          0          0 |    27,880 
        F1 |         0          0     27,464          0      1,200          0 |    28,664 
        FI |    16,344          0          0          0          0          0 |    16,344 
        FR |    25,952      7,928      3,128          0      1,432          0 |    38,440 
        GR |    23,608      7,512          0          0     21,896          0 |    53,016 
        HR |    20,440          0          0          0          0      2,800 |    23,240 
        HU |    25,000          0          0          0          0          0 |    25,000 
        IE |     8,280          0          0          0          0          0 |     8,280 
        IT |    23,192      8,312     12,216     14,200     10,312          0 |    68,232 
        Ia |     3,120         32          0        104          0        216 |     3,472 
        Ih |    18,560         48          0      3,440          0        856 |    22,904 
        Ir |     1,536      3,312          0      1,032          0        152 |     6,032 
        LT |    16,904          0          0          0          0          0 |    16,904 
        LU |    13,848          0          0          0      3,560          0 |    17,408 
        LV |    14,216          0          0          0          0          0 |    14,216 
        MT |    10,392          0          0          0          0          0 |    10,392 
        NL |    25,472      6,640      6,584     14,016          0          0 |    52,712 
        PL |    21,712          0          0          0      3,128     25,808 |    50,648 
        PT |    17,552          0          0          0          0          0 |    17,552 
        RO |    17,248          0          0          0          0          0 |    17,248 
        SE |    26,936      4,840          0     21,752          0          0 |    53,528 
        SI |    25,720          0          0      6,888     11,264          0 |    43,872 
        SK |    16,784          0          0          0          0          0 |    16,784 
-----------+------------------------------------------------------------------+----------
     Total |   596,936     69,544    186,408    165,288     68,952     29,832 | 1,116,960 

. tab inw1 wave,m         // 30,419 IDs present in wave 1                 

 inw1: =1 if |
  respondent |                                       Survey Wave
          w1 | 2004 wave  2006/07 w  2008/09 w  2011/12 w  2013 wave  2015 wave  2017 wave  2019/20 w |     Total
-------------+----------------------------------------------------------------------------------------+----------
   0.nonresp |   109,201    109,201    109,201    109,201    109,201    109,201    109,201    109,201 |   873,608 
1.resp,alive |    30,419     30,419     30,419     30,419     30,419     30,419     30,419     30,419 |   243,352 
-------------+----------------------------------------------------------------------------------------+----------
       Total |   139,620    139,620    139,620    139,620    139,620    139,620    139,620    139,620 | 1,116,960 

. tab inw_tot wave        // 139,620 total IDs

           |                                       Survey Wave
   inw_tot | 2004 wave  2006/07 w  2008/09 w  2011/12 w  2013 wave  2015 wave  2017 wave  2019/20 w |     Total
-----------+----------------------------------------------------------------------------------------+----------
         1 |    41,093     41,093     41,093     41,093     41,093     41,093     41,093     41,093 |   328,744 
         2 |    33,420     33,420     33,420     33,420     33,420     33,420     33,420     33,420 |   267,360 
         3 |    21,259     21,259     21,259     21,259     21,259     21,259     21,259     21,259 |   170,072 
         4 |    20,035     20,035     20,035     20,035     20,035     20,035     20,035     20,035 |   160,280 
         5 |    14,701     14,701     14,701     14,701     14,701     14,701     14,701     14,701 |   117,608 
         6 |     5,492      5,492      5,492      5,492      5,492      5,492      5,492      5,492 |    43,936 
         7 |     3,620      3,620      3,620      3,620      3,620      3,620      3,620      3,620 |    28,960 
-----------+----------------------------------------------------------------------------------------+----------
     Total |   139,620    139,620    139,620    139,620    139,620    139,620    139,620    139,620 | 1,116,960 

. tab inw_tot wave if hacohort==1 & inw1==1 // 30,419 IDs also present in wave 1

           |                                       Survey Wave
   inw_tot | 2004 wave  2006/07 w  2008/09 w  2011/12 w  2013 wave  2015 wave  2017 wave  2019/20 w |     Total
-----------+----------------------------------------------------------------------------------------+----------
         1 |     7,098      7,098      7,098      7,098      7,098      7,098      7,098      7,098 |    56,784 
         2 |     6,216      6,216      6,216      6,216      6,216      6,216      6,216      6,216 |    49,728 
         3 |     3,093      3,093      3,093      3,093      3,093      3,093      3,093      3,093 |    24,744 
         4 |     3,378      3,378      3,378      3,378      3,378      3,378      3,378      3,378 |    27,024 
         5 |     3,647      3,647      3,647      3,647      3,647      3,647      3,647      3,647 |    29,176 
         6 |     3,367      3,367      3,367      3,367      3,367      3,367      3,367      3,367 |    26,936 
         7 |     3,620      3,620      3,620      3,620      3,620      3,620      3,620      3,620 |    28,960 
-----------+----------------------------------------------------------------------------------------+----------
     Total |    30,419     30,419     30,419     30,419     30,419     30,419     30,419     30,419 |   243,352 

. tab iwstatr inw2 if wave==2,m // check consistency: everyone with iwstat 1 is inw in that wave

                      |      inw2: =1 if
                      |     respondent w2
   r interview status | 0.nonresp  1.resp,al |     Total
----------------------+----------------------+----------
              0.inap. |    92,072          0 |    92,072 
        1.resp, alive |         0     37,143 |    37,143 
          4.nr, alive |     6,823          0 |     6,823 
   5.nr, died this wv |       892          0 |       892 
9.nr, dk if alive or  |     2,690          0 |     2,690 
----------------------+----------------------+----------
                Total |   102,477     37,143 |   139,620 

. tab iwstatr wave, m                                                     

                      |                                       Survey Wave
   r interview status | 2004 wave  2006/07 w  2008/09 w  2011/12 w  2013 wave  2015 wave  2017 wave  2019/20 w |     Total
----------------------+----------------------------------------------------------------------------------------+----------
              0.inap. |   109,201     92,072     95,835     62,178     44,791     25,422      2,919      2,555 |   434,973 
        1.resp, alive |    30,419     37,143     27,958     58,000     66,065     68,085     77,202     46,733 |   411,605 
          4.nr, alive |         0      6,823      9,250     10,125     13,148     21,967     22,643     25,361 |   109,317 
   5.nr, died this wv |         0        892      1,236      1,317      2,412      3,013      4,235      3,937 |    17,042 
   6.nr, died prev wv |         0          0        716      2,056      3,333      6,342     10,727     15,582 |    38,756 
9.nr, dk if alive or  |         0      2,690      4,625      5,944      9,871     14,791     21,894     45,452 |   105,267 
----------------------+----------------------------------------------------------------------------------------+----------
                Total |   139,620    139,620    139,620    139,620    139,620    139,620    139,620    139,620 | 1,116,960 

. tab iwstatr wave if hacohort==1 & inw1==1, m    

                      |                                       Survey Wave
   r interview status | 2004 wave  2006/07 w  2008/09 w  2011/12 w  2013 wave  2015 wave  2017 wave  2019/20 w |     Total
----------------------+----------------------------------------------------------------------------------------+----------
              0.inap. |         0        696      3,601      6,482      4,367      1,568      1,033      1,168 |    18,915 
        1.resp, alive |    30,419     20,904     16,648     12,473     12,804     11,910     10,554      7,034 |   122,746 
          4.nr, alive |         0      5,237      5,835      5,375      4,303      5,625      4,716      3,698 |    34,789 
   5.nr, died this wv |         0        892        792        830        849        782      1,053        732 |     5,930 
   6.nr, died prev wv |         0          0        716      1,679      2,680      4,035      5,421      6,544 |    21,075 
9.nr, dk if alive or  |         0      2,690      2,827      3,580      5,416      6,499      7,642     11,243 |    39,897 
----------------------+----------------------------------------------------------------------------------------+----------
                Total |    30,419     30,419     30,419     30,419     30,419     30,419     30,419     30,419 |   243,352 

. tab iwstatr inw_tot if hacohort==1,m                    

                      |                                   inw_tot
   r interview status |         1          2          3          4          5          6          7 |     Total
----------------------+-----------------------------------------------------------------------------+----------
              0.inap. |    81,612     70,078     21,929     14,060     14,027      1,606          0 |   203,312 
        1.resp, alive |    25,089     41,962     29,010     34,233     44,274     28,498     28,792 |   231,858 
          4.nr, alive |    18,972     15,384      9,458      8,048      4,341      2,374        168 |    58,745 
   5.nr, died this wv |     3,456      2,964      1,824      1,473        640        306          0 |    10,663 
   6.nr, died prev wv |    14,012     10,125      2,993      1,201        405          0          0 |    28,736 
9.nr, dk if alive or  |    40,171     14,591      4,778      2,577        937        568          0 |    63,622 
----------------------+-----------------------------------------------------------------------------+----------
                Total |   183,312    155,104     69,992     61,592     64,624     33,352     28,960 |   596,936 

. tab iwstatr inw_tot if hacohort==1 & wave==1,m  

                      |                                   inw_tot
   r interview status |         1          2          3          4          5          6          7 |     Total
----------------------+-----------------------------------------------------------------------------+----------
              0.inap. |    15,816     13,172      5,656      4,321      4,431        802          0 |    44,198 
        1.resp, alive |     7,098      6,216      3,093      3,378      3,647      3,367      3,620 |    30,419 
----------------------+-----------------------------------------------------------------------------+----------
                Total |    22,914     19,388      8,749      7,699      8,078      4,169      3,620 |    74,617 

. tab inw_tot radyear

           |                                                                                         radyear: r death year
   inw_tot |      2004       2005       2006       2007       2008       2009       2010       2011       2012       2013       2014       2015       2016       2017       2018       2019       2020       2021 |     Total
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         1 |       384      2,320      3,568      2,592      3,160      2,376      2,632      3,936      6,168      5,128      4,496      3,592      3,272      2,512      3,232      3,232        944        408 |    53,952 
         2 |         0          0          0      1,624      2,624      2,192      2,520      2,480      2,896      3,752      5,240      4,280      4,296      3,072      2,392      2,176      1,768      1,032 |    42,344 
         3 |         0          0          0          0          0          0          0        792      1,792      1,568      1,496      2,432      4,664      3,560      2,424      2,680      1,312        616 |    23,336 
         4 |         0          0          0          0          0          0          0          0          0        680      1,456      1,328      1,680      2,064      3,736      3,272      1,336        672 |    16,224 
         5 |         0          0          0          0          0          0          0          0          0          0          0        672      1,368      1,104      1,032      1,144      1,176        832 |     7,328 
         6 |         0          0          0          0          0          0          0          0          0          0          0          0          0        464        928        832        536        288 |     3,048 
         7 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0          8        304        248 |       560 
-----------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       384      2,320      3,568      4,216      5,784      4,568      5,152      7,208     10,856     11,128     12,688     12,304     15,280     12,776     13,744     13,344      7,376      4,096 |   146,792 

. tab inw_tot raxyear

           |                                                                              raxyear: r death year in eol ivw
   inw_tot |      2004       2005       2006       2007       2008       2009       2010       2011       2012       2013       2014       2015       2016       2017       2018       2019       2020 |     Total
-----------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
         1 |       408      2,224      3,496      2,680      3,152      2,472      2,632      3,992      5,920      5,144      4,088      3,296      2,896      2,224      2,808      2,912        536 |    50,880 
         2 |        16         48        200      1,712      2,656      2,216      2,480      2,472      2,784      3,784      4,872      3,936      3,864      2,608      1,856      1,952        464 |    37,920 
         3 |         0          0         16         64         16         32         16        792      1,704      1,616      1,480      2,424      4,432      3,264      1,896      2,408        416 |    20,576 
         4 |         0          0         16         16          0          8          8          8         16        864      1,384      1,304      1,568      1,952      3,240      3,024        560 |    13,968 
         5 |         0          0          0          0          0          0          8          0          8          0         16        720      1,272        960        864      1,064        184 |     5,096 
         6 |         0          0          0          8          0          0          0          0          0          0          0          0          0        416        768        712         96 |     2,000 
-----------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       424      2,272      3,728      4,480      5,824      4,728      5,144      7,264     10,432     11,408     11,840     11,680     14,032     11,424     11,432     12,072      2,256 |   130,440 

. tab iwstatr wave,m

                      |                                       Survey Wave
   r interview status | 2004 wave  2006/07 w  2008/09 w  2011/12 w  2013 wave  2015 wave  2017 wave  2019/20 w |     Total
----------------------+----------------------------------------------------------------------------------------+----------
              0.inap. |   109,201     92,072     95,835     62,178     44,791     25,422      2,919      2,555 |   434,973 
        1.resp, alive |    30,419     37,143     27,958     58,000     66,065     68,085     77,202     46,733 |   411,605 
          4.nr, alive |         0      6,823      9,250     10,125     13,148     21,967     22,643     25,361 |   109,317 
   5.nr, died this wv |         0        892      1,236      1,317      2,412      3,013      4,235      3,937 |    17,042 
   6.nr, died prev wv |         0          0        716      2,056      3,333      6,342     10,727     15,582 |    38,756 
9.nr, dk if alive or  |         0      2,690      4,625      5,944      9,871     14,791     21,894     45,452 |   105,267 
----------------------+----------------------------------------------------------------------------------------+----------
                Total |   139,620    139,620    139,620    139,620    139,620    139,620    139,620    139,620 | 1,116,960 

. 
. *** drop IDs ***        /*choose IDs from first cohort that responded to wave 1, and [...]*/
. count                                   // 1,116,960 total
  1,116,960

. count if wave           ==1 // 139,620
  139,620

. count if hacohort       ==1 // 596,936
  596,936

. count if inw1           ==1     // 243,352
  243,352

. keep if hacohort==1 | hacohort==2 // 666,480 left, 450,480 deleted
(450,480 observations deleted)

. codebook ID, compact    // 83,310 IDs

Variable      Obs Unique      Mean  Min     Max  Label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
ID         666480  83310  76302.48    1  139620  group(countryID id)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. drop if countryID=="GR" /*relatively imprecise survey*/
(31,120 observations deleted)

. codebook ID, compact    // 79,420 IDs

Variable      Obs Unique      Mean  Min     Max  Label
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
ID         635360  79420  76229.22    1  139620  group(countryID id)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. *log close logSampleselection
.         
.         
. **generate subsamples**
. loc     sfull5  "(everdead==1|inw_tot>=5)"

. gen     sfull5 = `sfull5'

. gen     sfull = sfull5  

. la var  sfull "`sfull5'"

.         **check generation is correct**
.         tab sfull5 inw_tot if everdead==0

           |                                   inw_tot
    sfull5 |         1          2          3          4          5          6          7 |     Total
-----------+-----------------------------------------------------------------------------+----------
         0 |   158,264    127,920     59,072     52,048          0          0          0 |   397,304 
         1 |         0          0          0          0     60,688     41,488     28,960 |   131,136 
-----------+-----------------------------------------------------------------------------+----------
     Total |   158,264    127,920     59,072     52,048     60,688     41,488     28,960 |   528,440 

. sum d_anyatfirstobs 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
d_anyatfir~s |    634,808    .6963743    .4598233          0          1

. sum d_anyatfirstobs if sfull5

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
d_anyatfir~s |    238,040    .7463283    .4351128          0          1

. count if sfull5 
  238,056

. count if sfull5 & everiwstatr4==0
  164,984

. count if sfull5 & everiwstatr4==0 & everiwstatr9==0
  150,072

. *++
. */
. 
. **# Bookmark #1
.                 drop if wave==3 // is not really a time period, there are no regular variables for this wave
(79,420 observations deleted)

.                 
. 
.                 
. sort    ID wave

. save    "`h_data'H_panel2-MM.dta", replace // check if appeared in correct folder!
file G:/Shared drives/sharedStudents/BScThesis/Castor/SHAREdata/harmon/H_panel2-MM.dta saved

. *pause 
. 
. 
. 
. ****************************************************************************************************
. log close logDofile /*File ends here*/
      name:  logDofile
       log:  G:/My Drive/projects/projectMultimorbidity/outfiles/logs/logdoSHARE-2-harmonPart5.txt
  log type:  text
 closed on:  23 Dec 2023, 17:04:36
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
